import cn from "classnames";
import styles from "./MyRelease.module.css";

const MyRelease = ({ namePh, nameMd }) => {
  return (
    <div className={cn(styles.release)}>
      <h2>Модельний реліз</h2>
      <div className={cn(styles.info)}>
        <p>
          В обмін за цінну та відплатну винагороду, яка підписанням цього
          документа визнається достатньою та отриманою, я Модель
          <span className={cn(styles.names)}> {nameMd}</span> даю Фотографу
          <span className={cn(styles.names)}> {namePh}</span>, його/її юридичним
          представникам та правонаступникам, тим, за завданням яких діє
          Фотограф, а також тим, хто діє від його/її імені та з його/її
          дозволом, невід'ємне та необмежене право та дозвіл на авторські права,
          на його/її ім'я, а також на використання, повторне використання,
          публікацію та повторну публікацію фотопортретів та інших моїх знімків
          або тих знімків, на яких зображено/зображено я, зроблених Фотографом
          (Фотографії), повністю або частково, в якості частини складеного
          зображення або у зміненій формі та змісті, без обмежень у змінах, що
          допускаються на Фотографії.
        </p>
        <p>
          Підписувати Фотографії дозволяється як моїм, так і вигаданим ім'ям,
          репродукції можуть друкуватись як у кольорі, так і в монохромі, при
          використанні обладнання Фотографа або будь-якого іншого обладнання, та
          поширюватися будь-яким способом, з метою ілюстрації, просування
          товарів, як мистецтво, в публікаціях, рекламі, торгівлі, видавництві
          та для будь-яких інших цілей. Я також даю право на використання
          друкованих матеріалів у зв'язку із зазначеними вище цілями.
          Підписанням цього документа я відмовляюся від усіх прав на перегляд та
          схвалення готового продукту чи продукції, а також рекламних копій та
          інших пов'язаних матеріалів, або самої мети, для якої використовуються
          фотографії.
        </p>
        <p>
          Підписанням цього документа я даю Фотографу, найнятим Фотографом
          особам, його юридичним представникам та правонаступникам, а також
          іншим особам, які перебувають у підпорядкуванні у Фотографа, або тим,
          чиї завдання він виконує, обумовлені права та звільняю його від
          виконання зобов'язань та будь-якої відповідальності щодо будь-яких
          змін у Фотографіях та будь-яких цілей їх використання. Я підтверджую
          свою згоду з тим фактом, що не матиму на дані Фотографії жодних прав,
          всі права на дані Фотографії, включаючи авторські, належать Фотографу
          та його Правонаступникам. Я підтверджую свою згоду з тим фактом, що не
          матиму жодних прав на додаткове відшкодування або винагороду, і
          зобов'язуюсь надалі не пред'являти жодних вимог Фотографу та його/її
          Правонаступникам з будь-яких причин, включаючи звинувачення в наклепі
          та вторгненні в особисте життя. Я підтверджую свою згоду з тим, що
          перелічене та підписане в цьому документі має обов'язковий характер
          для мене, моїх спадкоємців, юридичних представників та
          правонаступників. Я підтверджую, що дана передача прав є остаточною,
          має всесвітню силу та необмежений термін дії. Підписанням цього
          документа я підтверджую досягнення мною повноліття та наявність права
          виступати від особи. Перед підписанням цього документа я повністю та
          ретельно ознайомився/ознайомилася із змістом цієї угоди.
        </p>
      </div>
    </div>
  );
};

export default MyRelease;
